InformationRegisters/Уведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Уведомления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Уведомления/Ext/Module.bsl
#Область ПрограммныйИнтерфейс 

Процедура СоздатьУведомление(Текст, Предмет) Экспорт

	Уведомление = РегистрыСведений.Уведомления.СоздатьМенеджерЗаписи();	
	Уведомление.Идентификатор = Новый УникальныйИдентификатор();   
	Уведомление.Текст = Текст;
	Уведомление.Предмет = Предмет;    
	Уведомление.Дата = Константы.ИгроваяДата.Получить();
	Уведомление.Записать();

КонецПроцедуры

Процедура УдалитьУведомление(Идентификатор) Экспорт

	НаборЗаписей = РегистрыСведений.Уведомления.СоздатьНаборЗаписей();	   
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор); 
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура УдалитьВсеУведомления() Экспорт

	НаборЗаписей = РегистрыСведений.Уведомления.СоздатьНаборЗаписей();	   
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти
